<img src="http://drive.google.com/uc?export=view&id=1tpOCamr9aWz817atPnyXus8w5gJ3mIts" width=500px>

Proprietary content. Â© Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited.

---
# Baseline Test - Advanced Certificate in Software Engineering - IIT Madras
---

# Instructions

- You need to add the code where ever you see "`/* Add your code here */`"
- Marks are mentioned along with the cells
- **Do not edit any of the prefilled text/code part**

## Run below cells before starting the test - Mandatory

#### Please run the below cell. Don't edit anything.

In [1]:
!pip install --upgrade pip
!pip install ipython-sql

%load_ext sql
%sql sqlite://

Requirement already satisfied: pip in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (21.1.2)
Requirement already satisfied: ipython-sql in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (0.4.0)
Requirement already satisfied: prettytable<1 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: six in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlparse in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: pygments in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: backcall in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: colorama in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: decorator in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\dheep.balaraman\anaconda3\envs\kaggleenv\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

#### Please run the below cell. Don't edit anything.

In [2]:
%%sql

CREATE TABLE if not exists `product` (
   `product_id` char(10) DEFAULT NULL,
   `product_name` varchar(24) DEFAULT NULL,
   `price` int(11) DEFAULT NULL,
   `product_category` varchar(45) DEFAULT NULL
 );
 
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P01','iphone 11',64000,'Mobile');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P02','ipad pro',81000,'Tablet');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P03','macbook air',75000,'Laptop');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P04','Sony 43 inch',55000,'TV');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P05','Samsung M31S',22000,'Mobile');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P06','Samsung A01',9000,'Mobile');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P07','Samsung 43 inch',45000,'TV');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P08','logi Keyboard',8500,'Accessories');
INSERT INTO `product` (`product_id`,`product_name`,`price`,`product_category`) VALUES ('P09','Apple Pencil',8500,'Accessories');

 
CREATE TABLE if not exists `customer` (
 `customer_id` int(11) DEFAULT NULL,
 `customer_name` varchar(15) DEFAULT NULL,
 `credit_limit` int(11) DEFAULT NULL);

INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (1,'Liya',32000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (2,'Jane',35000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (3,'Tom',40000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (4,'John',30000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (5,'Lizzy',36000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (6,'Maria',25000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (7,'Kate',28500);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (8,'Ben',50000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (9,'Ford',90000);
INSERT INTO `customer` (`customer_id`,`customer_name`,`credit_limit`) VALUES (10,'Stonq',100000);

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Please run the below cell. Don't edit anything.

In [3]:
%%sql

select * from product;

 * sqlite://
Done.

[('P01', 'iphone 11', 64000, 'Mobile'),
 ('P02', 'ipad pro', 81000, 'Tablet'),
 ('P03', 'macbook air', 75000, 'Laptop'),
 ('P04', 'Sony 43 inch', 55000, 'TV'),
 ('P05', 'Samsung M31S', 22000, 'Mobile'),
 ('P06', 'Samsung A01', 9000, 'Mobile'),
 ('P07', 'Samsung 43 inch', 45000, 'TV'),
 ('P08', 'logi Keyboard', 8500, 'Accessories'),
 ('P09', 'Apple Pencil', 8500, 'Accessories')]

#### Please run the below cell. Don't edit anything.

In [4]:
%%sql

select * from customer;

 * sqlite://
Done.

[(1, 'Liya', 32000),
 (2, 'Jane', 35000),
 (3, 'Tom', 40000),
 (4, 'John', 30000),
 (5, 'Lizzy', 36000),
 (6, 'Maria', 25000),
 (7, 'Kate', 28500),
 (8, 'Ben', 50000),
 (9, 'Ford', 90000),
 (10, 'Stonq', 100000)]

---

### **Refer to the `product` and `customer` table to answer the below questions**

## Question 1 (6 Marks)

Find out the lowest and highest price for each `product_category` in `product` table. 

Your query response should have three columns **product_category, min_price, max_price**.

In [9]:
%%sql

SELECT product_category, MIN(price) as min_price, MAX(price) as max_price FROM product GROUP BY product_category;

 * sqlite://
Done.

[('Accessories', 8500, 8500),
 ('Laptop', 75000, 75000),
 ('Mobile', 9000, 64000),
 ('TV', 45000, 55000),
 ('Tablet', 81000, 81000)]

## Question 2 (6 Marks)

Print details of top 5 customers with maximum credit limit in a descending order.

Your query response must have three columns **customer_id, customer_name, credit_limit**.

In [14]:
%%sql

SELECT customer_id, customer_name, credit_limit FROM customer
ORDER BY credit_limit DESC
LIMIT 5;

 * sqlite://
Done.

[(10, 'Stonq', 100000),
 (9, 'Ford', 90000),
 (8, 'Ben', 50000),
 (3, 'Tom', 40000),
 (5, 'Lizzy', 36000)]

## Question 3 (8 Marks)

For every customer, find out the products they can buy using their credit limit and order them by `customer_name`.
- Note: Customers can only buy products which are priced less than their credit limit.

Your query response must have 6 columns, **customer_id, customer_name, credit_limit, product_id, product_name, price**. Every row should be a unique pair of `customer_id` and `product_id`.

In [23]:
%%sql

SELECT cus.customer_id, cus.customer_name, cus.credit_limit, prd.product_id, prd.product_name, prd.price
FROM customer cus
LEFT JOIN product prd
ON cus.credit_limit >= prd.price
ORDER BY cus.customer_name;

 * sqlite://
Done.

[(8, 'Ben', 50000, 'P05', 'Samsung M31S', 22000),
 (8, 'Ben', 50000, 'P06', 'Samsung A01', 9000),
 (8, 'Ben', 50000, 'P07', 'Samsung 43 inch', 45000),
 (8, 'Ben', 50000, 'P08', 'logi Keyboard', 8500),
 (8, 'Ben', 50000, 'P09', 'Apple Pencil', 8500),
 (9, 'Ford', 90000, 'P01', 'iphone 11', 64000),
 (9, 'Ford', 90000, 'P02', 'ipad pro', 81000),
 (9, 'Ford', 90000, 'P03', 'macbook air', 75000),
 (9, 'Ford', 90000, 'P04', 'Sony 43 inch', 55000),
 (9, 'Ford', 90000, 'P05', 'Samsung M31S', 22000),
 (9, 'Ford', 90000, 'P06', 'Samsung A01', 9000),
 (9, 'Ford', 90000, 'P07', 'Samsung 43 inch', 45000),
 (9, 'Ford', 90000, 'P08', 'logi Keyboard', 8500),
 (9, 'Ford', 90000, 'P09', 'Apple Pencil', 8500),
 (2, 'Jane', 35000, 'P05', 'Samsung M31S', 22000),
 (2, 'Jane', 35000, 'P06', 'Samsung A01', 9000),
 (2, 'Jane', 35000, 'P08', 'logi Keyboard', 8500),
 (2, 'Jane', 35000, 'P09', 'Apple Pencil', 8500),
 (4, 'John', 30000, 'P05', 'Samsung M31S', 22000),
 (4, 'John', 30000, 'P06', 'Samsung A01', 9000),
 (4, 'John', 30000, 'P08', 'logi Keyboard', 8500),
 (4, 'John', 30000, 'P09', 'Apple Pencil', 8500),
 (7, 'Kate', 28500, 'P05', 'Samsung M31S', 22000),
 (7, 'Kate', 28500, 'P06', 'Samsung A01', 9000),
 (7, 'Kate', 28500, 'P08', 'logi Keyboard', 8500),
 (7, 'Kate', 28500, 'P09', 'Apple Pencil', 8500),
 (1, 'Liya', 32000, 'P05', 'Samsung M31S', 22000),
 (1, 'Liya', 32000, 'P06', 'Samsung A01', 9000),
 (1, 'Liya', 32000, 'P08', 'logi Keyboard', 8500),
 (1, 'Liya', 32000, 'P09', 'Apple Pencil', 8500),
 (5, 'Lizzy', 36000, 'P05', 'Samsung M31S', 22000),
 (5, 'Lizzy', 36000, 'P06', 'Samsung A01', 9000),
 (5, 'Lizzy', 36000, 'P08', 'logi Keyboard', 8500),
 (5, 'Lizzy', 36000, 'P09', 'Apple Pencil', 8500),
 (6, 'Maria', 25000, 'P05', 'Samsung M31S', 22000),
 (6, 'Maria', 25000, 'P06', 'Samsung A01', 9000),
 (6, 'Maria', 25000, 'P08', 'logi Keyboard', 8500),
 (6, 'Maria', 25000, 'P09', 'Apple Pencil', 8500),
 (10, 'Stonq', 100000, 'P01', 'iphone 11', 64000),
 (10, 'Stonq', 100000, 'P02', 'ipad pro', 81000),
 (10, 'Stonq', 100000, 'P03', 'macbook air', 75000),
 (10, 'Stonq', 100000, 'P04', 'Sony 43 inch', 55000),
 (10, 'Stonq', 100000, 'P05', 'Samsung M31S', 22000),
 (10, 'Stonq', 100000, 'P06', 'Samsung A01', 9000),
 (10, 'Stonq', 100000, 'P07', 'Samsung 43 inch', 45000),
 (10, 'Stonq', 100000, 'P08', 'logi Keyboard', 8500),
 (10, 'Stonq', 100000, 'P09', 'Apple Pencil', 8500),
 (3, 'Tom', 40000, 'P05', 'Samsung M31S', 22000),
 (3, 'Tom', 40000, 'P06', 'Samsung A01', 9000),
 (3, 'Tom', 40000, 'P08', 'logi Keyboard', 8500),
 (3, 'Tom', 40000, 'P09', 'Apple Pencil', 8500)]